t21/Walnut_X/Packages/.cache/Keil.Kinetis_K60_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_K60_DFP</name>
  <description>Freescale Kinetis K60 Series Device Support and Examples</description>

  <releases>
    <release version="1.4.0" date="2015-06-03">
      Updated MK65F18, MK66F18 device support and documentation.
    </release>
    <release version="1.3.0" date="2015-01-12">
      CMSIS-Core files updated for MK65F18 and MK66F18 device support
    </release>
    <release version="1.2.0" date="2014-09-04">
      CMSIS-Core files updated for MK63F12 and MK64F12 devices
    </release>
    <release version="1.1.0">
      Added FRDM-K64F development board examples
      Added TWR-K64F120M development board examples
    </release>
    <release version="1.0.2">
      Added TWR-K60D100M development boards
    </release>
    <release version="1.0.1">
      New devices: MK63FN1M0xxx12, MK64FN1M0xxx12, MK64FX512xxx12
    </release>
    <release version="1.0.0">
      First Release version of K60 Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>K60</keyword>
  </keywords>

  <devices>
    <family Dfamily="K60 Series" Dvendor="Freescale:78">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book name="Documents\dui0553a_cortex_m4_dgug.pdf"           title="Cortex-M4 Generic User Guide"/>


      <!-- ******************************  MK60DN512xxx10  ****************************** -->
      <device Dname="MK60DN512xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK60D10.h"  define="MK60DN512xxx10"/>
        <debug      svd="SVD\MK60D10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512.FLM"        start="0x00000000"  size="0x80000"                  default="1"/>

        <book name="Documents\K60P144M100SF2V2RM.pdf" title="MK60 100MHz Reference Manual"/>
        <book name="Documents\K60P144M100SF2V2.pdf"   title="MK60 100MHz Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 100MHz CPU Clock)
 - DSP Support, MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA contr. with 16 channels
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
 - PLL and FLL operation
 - Internal reference clocks (32kHz or 2MHz)
 - 12MHz to 32MHz crystal osc.
 - 32kHz to 40kHz crystal osc.
 - Internal 1kHz low power osc.
 - DC to 50MHz external square wave input clock

 Memories and Memory Interfaces
 - Up to 512 KB program flash
 - Up to 128 KB RAM
 - Up to 256 KB FlexNVM on FlexMemory devices
 - Flash security and protection features
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flex. timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flex. timer (FTM)
 - Carrier modulator timer (CMT)
 - Prog. delay block (PDB)
 - 1x4ch prog. interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - USB FS/LS OTG/Host/Device
 - SPI
 - CAN
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - up to 100 GPIO (pin interrupt, DMA request)
 - 5V tolerant inputs
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK60DN256xxx10  ****************************** -->
      <device Dname="MK60DN256xxx10">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device\Include\MK60D10.h"  define="MK60DN256xxx10"/>
        <debug      svd="SVD\MK60D10.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P256.FLM"        start="0x00000000"  size="0x40000"                  default="1"/>

        <book name="Documents\K60P144M100SF2V2RM.pdf" title="MK60 100MHz Reference Manual"/>
        <book name="Documents\K60P144M100SF2V2.pdf"   title="MK60 100MHz Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core (up to 100MHz CPU Clock)
 - DSP Support, MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

