t21/Walnut_X/Packages/.cache/Keil.Kinetis_K60_DFP.1.4.0.pdsc
 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA contr. with 16 channels
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks (32kHz or 2MHz)
 - 12MHz to 32MHz crystal osc.
 - 32kHz to 40kHz crystal osc.
 - Internal 1kHz low power osc.
 - DC to 50MHz external square wave input clock

 Memories and Memory Interfaces
 - Up to 1024 KB program flash memory on non-
   FlexMemory devices
 - Up to 512 KB program flash memory on
   FlexMemory devices
 - Up to 512 KB FlexNVM on FlexMemory devices
 - Up to 128KB  SRAM
 - Flash security and protection features
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flex. timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flex. timer (FTM)
 - Carrier modulator timer (CMT)
 - Prog. delay block (PDB)
 - 1x4ch prog. interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - USB FS/LS OTG/Host/Device
 - SPI
 - CAN
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - up to 100 GPIO (pin interrupt, DMA request)
 - 5V tolerant inputs
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK61FX512xxx15  ****************************** -->
      <device Dname="MK61FX512xxx15">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="150000000"/>
        <compile header="Device\Include\MK61F15.h"  define="MK61FX512xxx15"/>
        <debug      svd="SVD\MK61F15.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x80000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512X.FLM"       start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\MK_D512.FLM"        start="0x10000000"  size="0x80000"                  default="1"/>

        <book name="Documents\K61P256M150SF3RM.pdf" title="MK61 120/150 MHz Reference Manual"/>
        <book name="Documents\K61P256M150SF3.pdf"   title="MK61 150MHz Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core with FPU (up to 150MHz CPU Clock)
 - MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
  - 2-pin serial wire debug (SWD)
  - IEEE 1149.1 Joint Test Action Group (JTAG)
  - IEEE 1149.7 compact JTAG (cJTAG)
  - Trace port interface unit (TPIU)
  - Flash patch and breakpoint (FPB)
  - Data watchpoint and trace (DWT)
  - Instrumentation trace macrocell (ITM)

 System and power management
 - SW/HW watchdog with external monitor pin
 - DMA contr. with 16 channels
 - Low-leakage wake-up unit (LLWU)
 - Power management contr. with 10 different power modes
 - Non-maskable interrupt (NMI)
 - 128-bit unique identification (ID) number per chip

 Clocks
 - Multi-purpose clock generator
  - PLL and FLL operation
  - Internal reference clocks (32kHz or 2MHz)
 - 12MHz to 32MHz crystal osc.
 - 32kHz to 40kHz crystal osc.
 - Internal 1kHz low power osc.
 - DC to 50MHz external square wave input clock

 Memories and Memory Interfaces
 - Up to 1024 KB program flash memory on non-
   FlexMemory devices
 - Up to 512 KB program flash memory on
   FlexMemory devices
 - Up to 512 KB FlexNVM on FlexMemory devices
 - Up to 128KB  SRAM
 - Flash security and protection features
 - Serial flash programming interface (EzPort)

 Security and integrity
 - Cyclic redundancy check (CRC)

 Analog
 - 16-bit SAR ADC
 - Programmable voltage reference (VREF)
 - High-speed Analog comparator (CMP) with 6-bit DAC

 Timers
 - 1x8ch motor control/general purpose/PWM flex. timer (FTM)
 - 1x2ch quadrature decoder/general purpose/PWM flex. timer (FTM)
 - Carrier modulator timer (CMT)
 - Prog. delay block (PDB)
 - 1x4ch prog. interrupt timer (PIT)
 - Low-power timer (LPT)

 Communications
 - USB FS/LS OTG/Host/Device
 - SPI
 - CAN
 - I2C with SMBUS support
 - UART (w/ ISO7816, IrDA and HW flow control)

 Human-machine interface
 - up to 100 GPIO (pin interrupt, DMA request)
 - 5V tolerant inputs
 - Capacitive touch sensing inputs
        </description>
      </device>

      <!-- ******************************  MK63FN1M0xxx12  ****************************** -->
      <device Dname="MK63FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK63F12.h"  define="MK63FN1M0xxx12"/>
        <debug      svd="SVD\MK63F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>

        <book name="Documents\K63P144M120SF5RM.pdf" title="MK63FN1M0xxx12 Reference Manual"/>
        <book name="Documents\K63P144M120SF5.pdf"   title="MK63FN1M0xxx12 Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core with FPU (up to 120MHz CPU Clock)
 - MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
 - 2-pin serial wire debug (SWD)
 - IEEE 1149.1 Joint Test Action Group (JTAG)
 - IEEE 1149.7 compact JTAG (cJTAG)
 - Trace port interface unit (TPIU)
 - Flash patch and breakpoint (FPB)
 - Data watchpoint and trace (DWT)
 - Instrumentation trace macrocell (ITM)

Memories and memory interfaces
 - Up to 1 MB program flash memory on non-FlexMemory devices
 - Up to 260 KB RAM
 - Serial programming interface (EzPort)
 - FlexBus external bus interface

Clocks
 - 3 to 32 MHz crystal oscillator
 - 32 kHz crystal oscillator
 - Multi-purpose clock generator
 - 1 kHz, 32 kHz, and 4 Mhz internal reference clock

System peripherals
 - Multiple low-power modes to provide power
   optimization based on application requirements
 - Memory protection unit with multi-master
   protection
 - 16-channel DMA controller, supporting up to 63
   request sources
 - External watchdog monitor
 - Software watchdog
 - Low-leakage wakeup unit

Security and integrity modules
 - Hardware CRC module to support fast cyclic
   redundancy checks
 - Hardware random-number generator
 - Hardware encryption supporting DES, 3DES, AES,
   MD5, SHA-1, and SHA-256 algorithms
 - 128-bit unique identification (ID) number per chip

Human-machine interface
 - General-purpose input/output

Analog modules
 - Two 16-bit SAR ADCs
 - Two 12-bit DACs
 - Three analog comparators (CMP) containing a 6-bit
   DAC and programmable reference input
 - Voltage reference

Timers
 - Programmable delay block
 - Two 8-channel motor control/general purpose/PWM
   timers
 - Two 2-channel quadrature decoder/general purpose
   timers
 - IEEE 1588 timers
 - Periodic interrupt timers
 - 16-bit low-power timer
 - Carrier modulator transmitter
 - Real-time clock
       </description>
      </device>

      <!-- ******************************  MK64FN1M0xxx12  ****************************** -->
      <device Dname="MK64FN1M0xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK64F12.h"  define="MK64FN1M0xxx12"/>
        <debug      svd="SVD\MK64F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"        start="0x00000000"  size="0x100000"                 default="1"/>

        <book name="Documents\K64P144M120SF5RM.pdf" title="MK64 120 MHz Reference Manual"/>
        <book name="Documents\K64P144M120SF5.pdf"   title="MK64 120 MHz Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core with FPU (up to 120MHz CPU Clock)
 - MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
  - 2-pin serial wire debug (SWD)
  - IEEE 1149.1 Joint Test Action Group (JTAG)
  - IEEE 1149.7 compact JTAG (cJTAG)
  - Trace port interface unit (TPIU)
  - Flash patch and breakpoint (FPB)
  - Data watchpoint and trace (DWT)
  - Instrumentation trace macrocell (ITM)

 Memories and memory interfaces
 - Up to 1 MB program flash memory on non-
   FlexMemory devices
 - Up to 640 KB program flash memory on
   FlexMemory devices
 - Up to 128 KB FlexNVM on FlexMemory devices
 - 4 KB FlexRAM on FlexMemory devices
 - Up to 260 KB RAM
 - Serial programming interface (EzPort)
 - FlexBus external bus interface

Clocks
 - 3 to 32 MHz crystal oscillator
 - 32 kHz crystal oscillator
 - Multi-purpose clock generator
 - 1 kHz, 32 kHz, and 4 Mhz internal reference clock

System peripherals
 - Multiple low-power modes to provide power
   optimization based on application requirements
 - Memory protection unit with multi-master
   protection
 - 16-channel DMA controller, supporting up to 63
   request sources
 - External watchdog monitor
 - Software watchdog
 - Low-leakage wakeup unit

Security and integrity modules
 - Hardware CRC module to support fast cyclic
   redundancy checks
 - Hardware random-number generator
 - Hardware encryption supporting DES, 3DES, AES,
   MD5, SHA-1, and SHA-256 algorithms
 - 128-bit unique identification (ID) number per chip

Human-machine interface
 - General-purpose input/output

Analog modules
 - Two 16-bit SAR ADCs
 - Two 12-bit DACs
 - Three analog comparators (CMP) containing a 6-bit
   DAC and programmable reference input
 - Voltage reference

Timers
 - Programmable delay block
 - Two 8-channel motor control/general purpose/PWM timers
 - Two 2-channel quadrature decoder/general purpose timers
 - IEEE 1588 timers
 - Periodic interrupt timers
 - 16-bit low-power timer
 - Carrier modulator transmitter
 - Real-time clock
        </description>
      </device>

      <!-- ******************************  MK64FX512xxx12  ****************************** -->
      <device Dname="MK64FX512xxx12">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device\Include\MK64F12.h"  define="MK64FX512xxx12"/>
        <debug      svd="SVD\MK64F12.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x10000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P512X.FLM"       start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\MKD128_4KB_SECTOR.FLM"        start="0x10000000"  size="0x20000"                  default="1"/>

        <book name="Documents\K64P144M120SF5RM.pdf" title="MK64 120 MHz Reference Manual"/>
        <book name="Documents\K64P144M120SF5.pdf"   title="MK64 120 MHz Data Sheet"/>
        <description>
Core features
 - 32-bit ARM Cortex-M4 core with FPU (up to 120MHz CPU Clock)
 - MPU
 - Nested vectored interrupt contr. (NVIC)
 - Async. wake-up interrupt contr. (AWIC)
 - Debug and trace capability
  - 2-pin serial wire debug (SWD)
  - IEEE 1149.1 Joint Test Action Group (JTAG)
  - IEEE 1149.7 compact JTAG (cJTAG)
  - Trace port interface unit (TPIU)
  - Flash patch and breakpoint (FPB)
  - Data watchpoint and trace (DWT)
  - Instrumentation trace macrocell (ITM)

 Memories and memory interfaces
 - Up to 1 MB program flash memory on non-
   FlexMemory devices
 - Up to 640 KB program flash memory on
   FlexMemory devices
 - Up to 128 KB FlexNVM on FlexMemory devices
 - 4 KB FlexRAM on FlexMemory devices
 - Up to 260 KB RAM
 - Serial programming interface (EzPort)
 - FlexBus external bus interface

Clocks
 - 3 to 32 MHz crystal oscillator
 - 32 kHz crystal oscillator
 - Multi-purpose clock generator
 - 1 kHz, 32 kHz, and 4 Mhz internal reference clock

System peripherals
 - Multiple low-power modes to provide power
   optimization based on application requirements
 - Memory protection unit with multi-master
   protection
 - 16-channel DMA controller, supporting up to 63
   request sources
 - External watchdog monitor
 - Software watchdog
 - Low-leakage wakeup unit

Security and integrity modules
 - Hardware CRC module to support fast cyclic
   redundancy checks
 - Hardware random-number generator
 - Hardware encryption supporting DES, 3DES, AES,
   MD5, SHA-1, and SHA-256 algorithms
 - 128-bit unique identification (ID) number per chip

Human-machine interface
 - General-purpose input/output

Analog modules
 - Two 16-bit SAR ADCs
 - Two 12-bit DACs
 - Three analog comparators (CMP) containing a 6-bit
   DAC and programmable reference input
 - Voltage reference

Timers
 - Programmable delay block
 - Two 8-channel motor control/general purpose/PWM timers
 - Two 2-channel quadrature decoder/general purpose timers
 - IEEE 1588 timers
 - Periodic interrupt timers
 - 16-bit low-power timer
 - Carrier modulator transmitter
 - Real-time clock
        </description>
      </device>

