t21/Walnut_X/Packages/.cache/Keil.Kinetis_K60_DFP.1.4.0.pdsc
      <!-- ******************************  MK65FN2M0xxx18  ****************************** -->
      <device Dname="MK65FN2M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device\Include\MK65F18.h"  define="MK65FN2M0xxx18"/>
        <debug      svd="SVD\MK65F18.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P2M0.FLM"        start="0x00000000"  size="0x200000"                 default="1"/>

        <book name="Documents\K65P169M180SF5RMV2.pdf" title="MK65FN2M0xxx18 Reference Manual"/>
        <book name="Documents\K65P169M180SF5V2.pdf"   title="MK65FN2M0xxx18 Data Sheet"/>
        <description>
ARM Cortex-M4 with FPU running at up to 180 MHz
System
- System integration module
- Power management and mode controllers
- Multiple power modes available based on high speed run, run, wait, stop, and power-down modes
- Low-leakage wakeup unit
- Miscellaneous control module
- Crossbar switch
- Memory protection unit
- Peripheral bridge
- Direct memory access (DMA) controller with multiplexer
- External watchdog monitor
- Watchdog

Clocks
- Multiple clock generation options
- System oscillator to provide clock source for the MCU
- RTC oscillator to provide clock source for the RTC
- Crystal-less USB internal clock for USB device operation.

Security
- Cyclic Redundancy Check module for error detection
- Hardware encryption, along with a random number generator
- Tamper detect and secure storage

Analog
- High speed analog-to-digital converter
- Comparator
- Digital-to-analog converter
- Internal voltage reference
- Bandgap voltage reference

Timers
- Programmable delay block
- FlexTimers
- Low Power Timer/PWM
- Periodic interrupt timer
- Low power timer
- Carrier modulator transmitter
- Independent real time clock

Communications
- Ethernet MAC with IEEE 1588 capability
- USB OTG controller (USB0) with built-in FS/LS transceiver
- USB device charger detect
- USB voltage regulator
- HS USB OTG controller (USB1) with built-in HS/FS/LS physical layer
- CAN
- Serial peripheral interface
- Inter-integrated circuit (I2C)
- UART
- Secured Digital host controller
- Integrated interchip sound (I2S)

Human-Machine Interfaces (HMI)
- General purpose input/output controller
- Capacitive touch sense input interface enabled in hardware
        </description>
      </device>

      <!-- ******************************  MK65FX1M0xxx18  ****************************** -->
      <device Dname="MK65FX1M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device\Include\MK65F18.h"  define="MK65FX1M0xxx18"/>
        <debug      svd="SVD\MK65F18.svd"/>
        <memory     id="IROM1"                                start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                                start="0x10000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                                start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                                start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"                  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\MKD256_4KB_SECTOR.FLM"        start="0x10000000"  size="0x40000"                  default="1"/>

        <book name="Documents\K65P169M180SF5RMV2.pdf" title="MK65FX1M0xxx18 Reference Manual"/>
        <book name="Documents\K65P169M180SF5V2.pdf"   title="MK65FX1M0xxx18 Data Sheet"/>
        <description>
ARM Cortex-M4 with FPU running at up to 180 MHz
System
- System integration module
- Power management and mode controllers
- Multiple power modes available based on high speed run, run, wait, stop, and power-down modes
- Low-leakage wakeup unit
- Miscellaneous control module
- Crossbar switch
- Memory protection unit
- Peripheral bridge
- Direct memory access (DMA) controller with multiplexer
- External watchdog monitor
- Watchdog

Clocks
- Multiple clock generation options
- System oscillator to provide clock source for the MCU
- RTC oscillator to provide clock source for the RTC
- Crystal-less USB internal clock for USB device operation.

Security
- Cyclic Redundancy Check module for error detection
- Hardware encryption, along with a random number generator
- Tamper detect and secure storage

Analog
- High speed analog-to-digital converter
- Comparator
- Digital-to-analog converter
- Internal voltage reference
- Bandgap voltage reference

Timers
- Programmable delay block
- FlexTimers
- Low Power Timer/PWM
- Periodic interrupt timer
- Low power timer
- Carrier modulator transmitter
- Independent real time clock

Communications
- Ethernet MAC with IEEE 1588 capability
- USB OTG controller (USB0) with built-in FS/LS transceiver
- USB device charger detect
- USB voltage regulator
- HS USB OTG controller (USB1) with built-in HS/FS/LS physical layer
- CAN
- Serial peripheral interface
- Inter-integrated circuit (I2C)
- UART
- Secured Digital host controller
- Integrated interchip sound (I2S)

Human-Machine Interfaces (HMI)
- General purpose input/output controller
- Capacitive touch sense input interface enabled in hardware
        </description>
      </device>

      <!-- ******************************  MK66FN2M0xxx18  ****************************** -->
      <device Dname="MK66FN2M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device\Include\MK66F18.h"  define="MK66FN2M0xxx18"/>
        <debug      svd="SVD\MK66F18.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P2M0.FLM"        start="0x00000000"  size="0x200000"                 default="1"/>

        <book name="Documents\K66P144M180SF5RMV2.pdf" title="MK66FN2M0xxx18 Reference Manual"/>
        <book name="Documents\K66P144M180SF5V2.pdf"   title="MK66FN2M0xxx18 Data Sheet"/>
        <description>
ARM Cortex-M4 with FPU running at up to 180 MHz
System
- System integration module
- Power management and mode controllers
- Multiple power modes available based on high speed run, run, wait, stop, and power-down modes
- Low-leakage wakeup unit
- Miscellaneous control module
- Crossbar switch
- Memory protection unit
- Peripheral bridge
- Direct memory access (DMA) controller with multiplexer
- External watchdog monitor
- Watchdog

Clocks
- Multiple clock generation options
- System oscillator to provide clock source for the MCU
- RTC oscillator to provide clock source for the RTC
- Crystal-less USB internal clock for USB device operation.

Security
- Cyclic Redundancy Check module for error detection
- Hardware encryption, along with a random number generator

Analog
- High speed analog-to-digital converter
- Comparator
- Digital-to-analog converter
- Internal voltage reference
- Bandgap voltage reference

Timers
- Programmable delay block
- FlexTimers
- Low Power Timer/PWM
- Periodic interrupt timer
- Low power timer
- Carrier modulator transmitter
- Independent real time clock

Communications
- Ethernet MAC with IEEE 1588 capability
- USB OTG controller (USB0) with built-in FS/LS transceiver
- USB device charger detect
- USB voltage regulator
- HS USB OTG controller (USB1) with built-in HS/FS/LS physical layer
- CAN
- Serial peripheral interface
- Inter-integrated circuit (I2C)
- UART
- Secured Digital host controller
- Integrated interchip sound (I2S)

