t21/Walnut_X/Packages/.cache/Keil.Kinetis_K60_DFP.1.4.0.pdsc
Human-Machine Interfaces (HMI)
- General purpose input/output controller
- Capacitive touch sense input interface enabled in hardware
        </description>
      </device>

      <!-- ******************************  MK66FX1M0xxx18  ****************************** -->
      <device Dname="MK66FX1M0xxx18">
        <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="180000000"/>
        <compile header="Device\Include\MK66F18.h"  define="MK66FX1M0xxx18"/>
        <debug      svd="SVD\MK66F18.svd"/>
        <memory     id="IROM1"                                start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                                start="0x10000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                                start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                                start="0x1FFF0000"  size="0x10000"    init   ="0"   default="0"/>
        <algorithm  name="Flash\MK_P1M0.FLM"                  start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\MKD256_4KB_SECTOR.FLM"        start="0x10000000"  size="0x40000"                  default="1"/>

        <book name="Documents\K66P144M180SF5RMV2.pdf" title="MK66FX1M0xxx18 Reference Manual"/>
        <book name="Documents\K66P144M180SF5V2.pdf"   title="MK66FX1M0xxx18 Data Sheet"/>
        <description>
ARM Cortex-M4 with FPU running at up to 180 MHz
System
- System integration module
- Power management and mode controllers
- Multiple power modes available based on high speed run, run, wait, stop, and power-down modes
- Low-leakage wakeup unit
- Miscellaneous control module
- Crossbar switch
- Memory protection unit
- Peripheral bridge
- Direct memory access (DMA) controller with multiplexer
- External watchdog monitor
- Watchdog

Clocks
- Multiple clock generation options
- System oscillator to provide clock source for the MCU
- RTC oscillator to provide clock source for the RTC
- Crystal-less USB internal clock for USB device operation.

Security
- Cyclic Redundancy Check module for error detection
- Hardware encryption, along with a random number generator

Analog
- High speed analog-to-digital converter
- Comparator
- Digital-to-analog converter
- Internal voltage reference
- Bandgap voltage reference

Timers
- Programmable delay block
- FlexTimers
- Low Power Timer/PWM
- Periodic interrupt timer
- Low power timer
- Carrier modulator transmitter
- Independent real time clock

Communications
- Ethernet MAC with IEEE 1588 capability
- USB OTG controller (USB0) with built-in FS/LS transceiver
- USB device charger detect
- USB voltage regulator
- HS USB OTG controller (USB1) with built-in HS/FS/LS physical layer
- CAN
- Serial peripheral interface
- Inter-integrated circuit (I2C)
- UART
- Secured Digital host controller
- Integrated interchip sound (I2S)

Human-Machine Interfaces (HMI)
- General purpose input/output controller
- Capacitive touch sense input interface enabled in hardware
        </description>
      </device>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="MK60D10 CMSIS">
      <description>Freescale Kinetis K60D 100MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK60DN512xxx10"/>
      <accept  Dname="MK60DN256xxx10"/>
      <accept  Dname="MK60DX256xxx10"/>
      </condition>
    <condition id="MK60F12 CMSIS">
      <description>Freescale Kinetis K60F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK60FN1M0xxx12"/>
      <accept  Dname="MK60FX512xxx12"/>
    </condition>
    <condition id="MK61F12 CMSIS">
      <description>Freescale Kinetis K61F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK61FN1M0xxx12"/>
      <accept  Dname="MK61FX512xxx12"/>
    </condition>
    <condition id="MK60F15 CMSIS">
      <description>Freescale Kinetis K60F 150MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK60FN1M0xxx15"/>
      <accept  Dname="MK60FX512xxx15"/>
    </condition>
    <condition id="MK61F15 CMSIS">
      <description>Freescale Kinetis K61F 150MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK61FN1M0xxx15"/>
      <accept  Dname="MK61FX512xxx15"/>
    </condition>
    <condition id="MK63F12 CMSIS">
      <description>Freescale Kinetis K63F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK63FN1M0xxx12"/>
    </condition>
    <condition id="MK64F12 CMSIS">
      <description>Freescale Kinetis K64F 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK64FN1M0xxx12"/>
      <accept  Dname="MK64FX512xxx12"/>
    </condition>
    <condition id="MK65F18 CMSIS">
      <description>Freescale Kinetis K65F 180MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK65FN2M0xxx18"/>
      <accept  Dname="MK65FX1M0xxx18"/>
    </condition>
    <condition id="MK66F18 CMSIS">
      <description>Freescale Kinetis K66F 180MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept  Dname="MK66FN2M0xxx18"/>
      <accept  Dname="MK66FX1M0xxx18"/>
    </condition>
