t21/Walnut_X/Packages/.cache/Keil.Kinetis_K60_DFP.1.4.0.pdsc
  </conditions>

  <components>
    <!-- Startup MK60D10 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK60D10 CMSIS">
      <description>System Startup for Freescale MK60D10 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK60D10.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK60D10.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK60F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK60F12 CMSIS">
      <description>System Startup for Freescale MK60F12 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK60F12.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK60F12.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK61F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK61F12 CMSIS">
      <description>System Startup for Freescale MK61F12 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK61F12.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK61F12.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK60F15 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK60F15 CMSIS">
      <description>System Startup for Freescale MK60F15 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK60F15.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK60F15.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK61F15 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK61F15 CMSIS">
      <description>System Startup for Freescale MK61F15 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK61F15.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK61F15.c"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MK63F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK63F12 CMSIS">
      <description>System Startup for Freescale MK63F12 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK63F12.s" attr="config" version="2.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK63F12.c"      attr="config" version="2.3.0"/>
      </files>
    </component>
    <!-- Startup MK64F12 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MK64F12 CMSIS">
      <description>System Startup for Freescale MK64F12 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK64F12.s" attr="config" version="2.3.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK64F12.c"      attr="config" version="2.3.0"/>
      </files>
    </component>
    <!-- Startup MK65F18 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="MK65F18 CMSIS">
      <description>System Startup for Freescale MK65F18 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK65F18.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK65F18.c"      attr="config" version="3.0.0"/>
        <file category="header"  name="Device\Source\system_MK65F18.h"      attr="config" version="3.0.0"/>
      </files>
    </component>
    <!-- Startup MK66F18 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="MK66F18 CMSIS">
      <description>System Startup for Freescale MK66F18 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_MK66F18.s" attr="config" version="3.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MK66F18.c"      attr="config" version="3.0.0"/>
        <file category="header"  name="Device\Source\system_MK66F18.h"      attr="config" version="3.0.0"/>
      </files>
    </component>
  </components>

  <boards>
    <board name="TWR-K60D100M" vendor="Freescale" revision="Rev. A" orderForm="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-K60D100M" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-K60D100M is a development tool for the 100 MHz K60, K20, and K10 families of Kinetis microcontrollers.</description>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-K60D100M" title="TWR-K60D100M Web Page"/>
      <book category="setup"     name="Documents\TWR-K60D100MQSG.pdf"  title="Quick Start Guide"/>
      <book category="schematic" name="Documents\TWR-K60D100M_SCH.pdf" title="Schematic"/>
      <book category="manual"    name="Documents\TWRK60D100MUM.pdf"    title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MK60DN512xxx10"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="K60 Series"/>
      <image small="Images\TWR-K60D100M_small.PNG" large="Images\TWR-K60D100M_large.PNG"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="Battery holder for 20mm lithium battery (e.g. 2032, 2025)"/>
      <feature type="MemCard"   n="1"              name="SD Card holder"/>
      <feature type="USB"       n="1"              name="High-Speed USB Mini-B Connector"/>
      <feature type="ConnOther" n="1"              name="Touch Tower Plug-in Socket"/>
      <feature type="ConnOther" n="1"              name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"      n="1"/>
      <feature type="Button"    n="2"/>
      <feature type="Touch"     n="4"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="4"              name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"   n="1"/>
    </board>
    <board name="TWR-K64F120M" vendor="Freescale" revision="Rev. A" orderForm="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-K64F120M" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK64FN1M0xxx12"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK64FX512xxx12"/>
      <description>The TWR-K64F120M is a development board for the Kinetis K24, K63 and K64 120 MHz 32-bit ARM® Cortex™-M4 MCUs.
      It features the Kinetis MK64FN1M0VMD12 low-power MCU with 1MB Flash, 256 KB SRAM, USB USB and Ethernet MAC.
      </description>
      <image small="Images\TWR-K64F120M_small.png" large="Images\TWR-K64F120M_large.png"/>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-K64F120M" title="TWR-K64F120M Web Page"/>
      <book category="setup"     name="Documents\TWRK64FQSG.pdf" title="Quick Start Guide"/>
      <feature type="ODbg"      n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="Battery holder for 20mm lithium battery (e.g. 2032, 2025)"/>
      <feature type="MemCard"   n="1"              name="SD Card holder"/>
      <feature type="USB"       n="1"              name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther" n="1"              name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther" n="2"              name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"      n="1"/>
      <feature type="Button"    n="2"/>
      <feature type="Touch"     n="4"/>
      <feature type="Accelerometer" n="1"          name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"       n="4"              name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"   n="1"/>
    </board>
    <board name="FRDM-K64F" vendor="Freescale" revision="Rev. A" orderForm="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=FRDM-K64F" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK64FN1M0xxx12"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK64FX512xxx12"/>
      <description>
        The FRDM-K64F is a development board for the Kinetis K24, K63 and K64 120 MHz 32-bit ARM® Cortex™-M4 MCUs.
        It features the Kinetis MK64FN1M0VMD12 low-power MCU with 1MB Flash, 256 KB SRAM, USB USB and Ethernet MAC.
      </description>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=FRDM-K64F" title="FRDM-K64F Web Page"/>
      <book category="setup"     name="Documents\FRDMK64QSG.pdf" title="Quick Start Guide"/>
      <book category="schematic" name="Documents\FRDM-K64F_SCH.pdf" title="FRDM-K64F Schematics"/>
      <book category="manual"    name="Documents\FRDMK64FUG.pdf" title="User Manual"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="MemCard"       n="1"              name="Micro SD Card holder"/>
      <feature type="USB"           n="1"              name="Micro-AB USB connector"/>
      <feature type="USB"           n="1"              name="OpenSDAv2 Micro USB connector"/>
      <feature type="ETH"           n="1"              name="10/100 Ethernet Port"/>
      <feature type="Button"        n="3"/>
      <feature type="Accelerometer" n="1"              name="Freescale FXOS8700CQ low-power, six-axis Xtrinsic sensor"/>
      <feature type="DIO"           n="8"              name="nRF24L01+ Nordic 2.4G Radio module expansion pins"/>
      <feature type="DIO"           n="4"              name="JY-MCU BT board V1.05 BT module expansion pins"/>
      <feature type="DIO"           n="33"             name="Digital IOs"/>
      <feature type="AIO"           n="9"              name="Analog IOs"/>
      <feature type="LED"           n="1"              name="RGB LED"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>
    <board name="TWR-K65F180M" vendor="Freescale" revision="Rev. A" orderForm="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-K65F180M" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK65FN2M0xxx18"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MK65FX1M0xxx18"/>
      <description>
        The TWR-K65F is a development board for the Kinetis K65 180 MHz 32-bit ARM® Cortex™-M4 MCUs.
        It features the Kinetis MK65FN2M0xxx18 MCU with MB Flash, 256 KB SRAM, USB USB and Ethernet MAC.
      </description>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>

  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K60D100M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K60D100M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <!-- TWR-K64F120M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K64F120M\Blinky">
      <description>Blinky example</description>
      <board name="TWR-K64F120M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K64F120M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K64F120M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <!-- FRDM-K64F Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-K64F\Blinky">
      <description>Blinky example</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-K64F\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-K64F" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <!-- TWR-K65F180M Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K65F180M\Blinky">
      <description>Blinky example</description>
      <board name="TWR-K65F180M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-K65F180M\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-K65F180M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

</package>
